// Задача 27
/*Console.Write("Введите число: ");
string a = (Console.ReadLine());
int len = a.Length;

int[] chislo;
chislo = new int[len];

int sum=0;

for (int i = 0; i < len; i++)
{
     chislo[i] = Convert.ToInt32(a[i]); /// не понимаю, почему конвертация символа в число идет неверная, хотя логика верная
     Console.WriteLine($"Получается число {chislo[i]} из символа {a[i]}");  // вывод неверной конвертации
     sum = sum + a[i];
}
Console.Write("Сумма чисел = ");
Console.Write(sum);
*/
